Documents/гф_СпецификацияПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_СпецификацияПокупателя</Name>
			<Comment>#wortmann #Спецификация покупателя Галфинд Окунев 2022/07/10</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказыКлиентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ChartsOfCharacteristicTypes/гф_ГлобальныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<ChartOfCharacteristicTypes>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_ГлобальныеЗначения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.гф_ГлобальныеЗначения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДанныеХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.гф_ГлобальныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорыДляРоялти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Documents/гф_СпецификацияПокупателя/Forms/гф_ФормаВыбораПечатнойСчетаФормыДляСпецификации/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КомандыПечати = УправлениеПечатью.КомандыПечатиОбъектаДоступныеДляВложений(Метаданные.Документы["СчетНаОплатуКлиенту"]);
	мПечатныеФормы = Новый Массив;	
	Для Каждого КомандаПечати Из КомандыПечати Цикл
		Если Не ЗначениеЗаполнено(КомандаПечати.Обработчик) Тогда
			мПечатныеФормы.Добавить(КомандаПечати.Представление);
		КонецЕсли;
	КонецЦикла;
	Элементы.ПечатнаяФорма.СписокВыбора.ЗагрузитьЗначения(мПечатныеФормы);
	
	гф_ПечатнаяФормаСчетаДляСпецификацииПокупателя = 
		_омОбщегоНазначенияВызовСервера.ПолучитьГлобальноеЗначение("гф_ПечатнаяФормаСчетаДляСпецификацииПокупателя");
	Если гф_ПечатнаяФормаСчетаДляСпецификацииПокупателя = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найдено глобальное значение по ключу <гф_ПечатнаяФормаСчетаДляСпецификацииПокупателя>!";
		Сообщение.Сообщить();
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСохранить.Доступность = Ложь;
		Элементы.ПечатнаяФорма.Доступность = Ложь;
	Иначе
		ПечатнаяФорма = гф_ПечатнаяФормаСчетаДляСпецификацииПокупателя;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Если ЗначениеЗаполнено(ПечатнаяФорма) Тогда
		СохранитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	ГлобЗначСсылка = ПланыВидовХарактеристик.гф_ГлобальныеЗначения.НайтиПоРеквизиту("Ключ", "гф_ПечатнаяФормаСчетаДляСпецификацииПокупателя");
	Если ЗначениеЗаполнено(ГлобЗначСсылка) Тогда
		ГлобЗначОбъект = ГлобЗначСсылка.ПолучитьОбъект();
		ГлобЗначОбъект.Значение = ПечатнаяФорма;
		ГлобЗначОбъект.Записать();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выбранное значение сохранено!";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры
